load-tests/artillery-concurrent.yml
config:
  target: "https://uniforge.kr"
  phases:
    - duration: 30
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up to 50 users"
    - duration: 60
      arrivalRate: 50
      rampTo: 100
      name: "Ramp to 100 users"
    - duration: 30
      arrivalRate: 100
      rampTo: 200
      name: "Ramp to 200 users"
    - duration: 60
      arrivalRate: 200
      name: "Sustain 200 users"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Marketplace asset query"
    flow:
      - get:
          url: "/api/assets?sort=latest"
      - think: 2