load-tests/drama-stress.yml
config:
  target: "https://uniforge.kr"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: "Phase 1: Warm up (100 users)"
    - duration: 60
      arrivalRate: 100
      rampTo: 300
      name: "Phase 2: Stressing (300 users)"
    - duration: 60
      arrivalRate: 300
      rampTo: 500
      name: "Phase 3: Peak Load (500 users)"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Intensive Marketplace Activity"
    flow:
      - get:
          url: "/api/assets?sort=latest"
      - think: 1
      - get:
          url: "/api/assets?genre=테스트"
      - think: 1